Repository: DwijanX/standard-branding
Catalog: locales/*/LC_MESSAGES/branding.po
Languages: et_ee

source: Open Swish App
et_ee: Avage rakendus Swish

source: To complete the payment, open your Swish App on your mobile device and authorize the payment
et_ee: Makse lõpetamiseks avage oma mobiilseadmes oma rakendus Swish ja kinnitage makse

source: You have 3 minutes to complete the payment
et_ee: Palun sooritage makse 3 minuti jooksul

source: Waiting for authorization
et_ee: Ootan autoriseerimist

source: Please wait...
et_ee: Palun oodake...

source: Click here if processing takes a long time
et_ee: Klõpsa siia, kui töötlemine võtab kaua aega

source: When finished, you will be redirected back to your receipt.
et_ee: Kui olete lõpetanud, suunatakse teid tagasi kviitungi juurde.

source: Proceed to payment
et_ee: Jätkake maksega

source: When you click the button below, the Resurs payment window will open.
et_ee: Kui klõpsad alloleval nupul avaneb Resurs makse aken.

source: When you click the button below, the iDeal payment window will open.
et_ee: Allpool asuvale nupule klõpsates avaneb iDeali makseaken.

source: Bank
et_ee: Pangas

source: Proceed
et_ee: Edasi

source: When you click the button below, the paysafecard payment window will open.
et_ee: Alloleval nupul klõpsamisel avaneb paysafecard kaudu makseaken.

source: First name
et_ee: Eesnimi

source: Last name
et_ee: Perekonnanimi

source: When you click the button below, the Trustly payment window will open.
et_ee: Kui klõpsad alloleval nupul avaneb Trustly makse aken.

source: When you click the button below, the Vipps payment window will open.
et_ee: Kui klõpsate allpool asuvat nuppu, avaneb Vipps makseaken.

source: When you click the button below, the PayPal payment window will open.
et_ee: Kui vajutad allolevale nupule avaneb PayPal makse aken.

source: Mobile number
et_ee: Mobiiltelefon

source: When you click the button below, the ViaBill payment window will open.
et_ee: Kui vajutad allolevale nupule avaneb ViaBill makse aken.

source: When you click the button below, the Sofort payment window will open.
et_ee: Kui vajutad allolevale nupule avaneb Sofot makse aken.

source: An error happened.
et_ee: Tekkis viga.

source: Please try again.
et_ee: Palun proovige uuesti.

source: You tried to make a live payment on a test transaction.
et_ee: Proovisite katsetamise faasis reaalselt maksa.

source: You tried to make a test payment on a live transaction.
et_ee: Püüdsite sooritada katsemakset reaalsel tehingul.

source: Name on card
et_ee: Nimi kaardil

source: Card number
et_ee: Kaardi number

source: Expiration date
et_ee: Kaart aegub

source: The CVV/CVD increases the level of security. Usually the card verification data is a three digit number, placed at the backside of the card.
et_ee: Turvakood teeb tehingu turvalisemaks. Tavaliselt on see kolmekohaline number kaardi tagumisel küljel.

source: Enable 3D Secure
et_ee: Luba 3D Secure makse

source: 3D Secure is a 2 step verification service using a text message to your phone.
et_ee: 3D Secure on kaheetapiline turvakontrolliteenus, mis saadab mobiiltelefonile tekstsõnumi.

source: Your credit card issuer may require you to use 3D Secure as an extra precaution.
et_ee: Teie krediitkaardi väljastaja võib turvameetmena paluda Teil kasutada 3D Secure makset.

source: Pay
et_ee: Maksa

source: Create subscription
et_ee: Koosta tellimus

source: Save card
et_ee: Salvesta kaardi andmed

source: Receive
et_ee: Võta vastu

source: Payment fee
et_ee: Makse töötlemise tasu

source: Fill in card number
et_ee: Lisa kaardi number

source: When you click the button below, the Klarna payment window will open.
et_ee: Kui vajutad allolevale nupule avaneb Klarna makse aken.

source: You have cancelled the payment
et_ee: Tühistasite makse

source: Order number
et_ee: Tellimuse number

source: You have completed the payout
et_ee: Makse on sooritatud

source: You have completed the payment
et_ee: Makse on sooritatud

source: Other Payment Methods
et_ee: Muud maksevahendid

source: Cards
et_ee: Kaardid

source: You are about to abort the payment. Are you sure?
et_ee: Valisite makse tühistamise. Kas olete kindel?

source: Cancel Payment
et_ee: Tühista makse

source: Order expired
et_ee: Tellimus on aegunud

source: You did not finish the purchase within the time frame.
et_ee: Ostu sooritamise aeg sai otsa.

source: Click here to continue
et_ee: Edasi

source: The order is already paid.
et_ee: Tellimuse eest on juba makstud.

source: Continue to the shop
et_ee: Edasi poodi

source: An unknown error happened.
et_ee: Tundmatu viga.

source: Unable to complete payment
et_ee: Makset ei saa lõpetada

source: 3D Secure authorization failed.
et_ee: 3D Secure isikutunnistus ei õnnestunud.

source: Please try again or select another payment method.
et_ee: Palun proovige uuesti või valige muu maksemeetod.

source: 3D Secure enrollment failed.
et_ee: Registreerumine 3D Secure kasutajaks ebaõnnestus.

source: The payment details have changed since you initiated the payment.
et_ee: Makse andmed on pärast makse alustamist muutunud.

source: Click here to start over
et_ee: Alusta uuesti

source: Try again
et_ee: Proovige uuesti
